Тест_ЗУП_31_КОРП/src/Documents/ПериодыОплаченныеДоНачалаЭксплуатации/ПериодыОплаченныеДоНачалаЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПериодыОплаченныеДоНачалаЭксплуатации</name>
  <registerRecords>InformationRegister.ДанныеСостоянийСотрудников</registerRecords>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <registerRecords>InformationRegister.ПараметрыПериодовСтажаПФР</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.Начисления</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <comment>Периоды, уже оплаченные до начала эксплуатации</comment>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПериода</name>
      <type>
        <types>EnumRef.СостоянияСотрудника</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСтажаПФР</name>
      <type>
        <types>EnumRef.ВидыСтажаПФР2014</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксРасчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплаченоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплаченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксСтрока</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксЗаполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксРасчетВремени</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВЧасах</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРегистрацииВремени</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботыНорма</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.ГрафикиРаботыСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУчетаВремени</name>
      <type>
        <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.ГрафикиРаботыСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВычета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВычета</name>
      <type>
        <types>CatalogRef.ВидыВычетовНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетнаяБазаЗаЕдиницуНормыВремени</name>
      <comment>Расчетная база на единицу нормы времени для расчета сторно-записей</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийГрафик</name>
      <type>
        <types>CatalogRef.ГрафикиРаботыСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРегистрацииНормыВремени</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Enums/СостоянияСотрудника/СостоянияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСотрудника</name>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>РаботаВОтпускеПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
  </enumValues>
  <enumValues>
    <name>ВынужденныйПрогул</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботника</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ПростойНеЗависящийОтРаботодателяИРаботника</name>
  </enumValues>
  <enumValues>
    <name>ОтпускОсновной</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйОтпускНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйОплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНеоплачиваемыйПоРазрешениюРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНеоплачиваемыйПоЗаконодательству</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеССохранениемОплаты</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеГосударственныхОбязанностей</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеПоНевыясненнымПричинам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНаСанаторноКурортноеЛечение</name>
  </enumValues>
  <enumValues>
    <name>Болезнь</name>
  </enumValues>
  <enumValues>
    <name>БолезньБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/КатегорииНачисленийИНеоплаченногоВремени/КатегорииНачисленийИНеоплаченногоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииНачисленийИНеоплаченногоВремени</name>
  <enumValues>
    <name>ПовременнаяОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>СдельнаяОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ОплатаТрудаВНатуральнойФорме</name>
  </enumValues>
  <enumValues>
    <name>ДоходВНатуральнойФорме</name>
  </enumValues>
  <enumValues>
    <name>КомпенсационныеВыплаты</name>
  </enumValues>
  <enumValues>
    <name>Премия</name>
  </enumValues>
  <enumValues>
    <name>КвартальнаяПремия</name>
  </enumValues>
  <enumValues>
    <name>РайонныйКоэффициент</name>
  </enumValues>
  <enumValues>
    <name>СевернаяНадбавка</name>
  </enumValues>
  <enumValues>
    <name>УправленческийУчет</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеНаПериодОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеКомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ОплатаОтпуска</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЕдиновременнаяВыплатаКОтпускуГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>ЕдиновременнаяВыплатаКОтпуску</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощьПриОтпускеГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощьПриОтпуске</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>НеявкаПоБолезни</name>
  </enumValues>
  <enumValues>
    <name>НеявкаПоНевыясненнымПричинам</name>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботника</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПростояПоВинеРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПростояПоНезависящимОтРаботодателяПричинам</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеНаПериодКомандировки</name>
  </enumValues>
  <enumValues>
    <name>ОплатаКомандировки</name>
  </enumValues>
  <enumValues>
    <name>СохраняемоеДенежноеСодержание</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоСреднемуЗаработку</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработка</name>
  </enumValues>
  <enumValues>
    <name>ОплатаСверхурочныхВоеннослужащим</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодамВоеннослужащего</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоЛиста</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоЛистаЗаСчетРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоПрофзаболевание</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоНесчастныйСлучайНаПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработкаЗаДниБолезни</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеОплатаДнейУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ОплатаДнейУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоПолутораЛетВоеннослужащим</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоПолутораЛет</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоТрехЛет</name>
  </enumValues>
  <enumValues>
    <name>ВыходноеПособиеМесячноеДенежноеСодержание</name>
  </enumValues>
  <enumValues>
    <name>ВыходноеПособие</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаСовмещение</name>
  </enumValues>
  <enumValues>
    <name>БолезньБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодамБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗаработокНаВремяТрудоустройства</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощь</name>
  </enumValues>
  <enumValues>
    <name>Льгота</name>
  </enumValues>
  <enumValues>
    <name>ВыбираемаяСотрудникомЛьгота</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаВредность</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНаСанаторноКурортноеЛечение</name>
  </enumValues>
  <enumValues>
    <name>Отгул</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПредыдущимиДокументами</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоДенежногоСодержанияЗаДниБолезни</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаНеотработанныеДниЧасыПриУвольнении</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаНеотработанныеДниПриУвольненииГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>ДоначислениеДоУправленческогоУчета</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияМоральногоВреда</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/ПериодыОплаченныеДоНачалаЭксплуатации/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	КадровыйУчетФормы.ФормаКадровогоДокументаПриСозданииНаСервере(ЭтаФорма);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		УстановитьВидРасчета();
		
		Если Не ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
			Объект.ПериодРегистрации = КонецМесяца(ТекущаяДатаСеанса()) + 1;
		КонецЕсли;
		
		ЗначенияДляЗаполнения = Новый Структура;
		ЗначенияДляЗаполнения.Вставить("Ответственный", "Объект.Ответственный");
		Если Параметры.ЗначенияЗаполнения.Свойство("Организация") 
			И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Организация) Тогда
			Объект.Организация = Параметры.ЗначенияЗаполнения.Организация;
		КонецЕсли;
		
		ЗначенияДляЗаполнения.Вставить("Организация", "Объект.Организация");
		Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") Тогда
			ЗначенияДляЗаполнения.Вставить("Подразделение", "Объект.Подразделение");
		КонецЕсли; 
		
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
		
		ПриПолученииДанныхНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПриПолученииДанныхНаСервере();
	
	ОбменДаннымиЗарплатаКадры.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ПериодыОплаченныеДоНачалаЭксплуатации", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	НастроитьОтображениеПодразделений();
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцСтрокой", Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ПериодРегистрации", "МесяцСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцСтрокой", Направление, Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисления

&НаКлиенте
Процедура НачисленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СотрудникиОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСотрудникПриИзменении(Элемент)
	ДополнитьСтрокуРасчета(Элементы.Начисления.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДатаНачалаПриИзменении(Элемент)
	ДополнитьСтрокуРасчета(Элементы.Начисления.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДатаОкончанияПриИзменении(Элемент)
	ДополнитьСтрокуРасчета(Элементы.Начисления.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовПодвалаФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПодборСотрудников(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыОткрытия.Вставить("АдресСпискаПодобранныхСотрудников", АдресСпискаПодобранныхСотрудников());
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ГоловнаяОрганизация", Объект.Организация);
	
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыОткрытия, Элементы.Начисления, Истина);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()

	ИспользуетсяРасчетЗарплаты = ПолучитьФункциональнуюОпцию("ИспользоватьРасчетЗарплатыРасширенная");
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцСтрокой");
	
	УстановитьПараметрыВыбораВидуПериода();
	
	УстановитьФункциональныеОпцииФормы();
	
	УстановитьСвойстваЭлементовФормы();
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьПараметрыВыбораВидуПериода()
	
	ДопустимыеЗначенияВвода = Новый Массив;
	
	ДопустимыеЗначенияВвода.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.Работа"));
	ДопустимыеЗначенияВвода.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.ОтпускОсновной"));
	ДопустимыеЗначенияВвода.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.ДополнительныйОтпуск"));
	ДопустимыеЗначенияВвода.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.ДополнительныйОтпускНеоплачиваемый"));
	ДопустимыеЗначенияВвода.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.ОтпускУчебныйОплачиваемый"));
	ДопустимыеЗначенияВвода.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.ОтпускУчебныйНеоплачиваемый"));
	ДопустимыеЗначенияВвода.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.ОтпускНеоплачиваемыйПоРазрешениюРаботодателя"));
	ДопустимыеЗначенияВвода.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.ОтпускНеоплачиваемыйПоЗаконодательству"));
	ДопустимыеЗначенияВвода.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.Командировка"));
	ДопустимыеЗначенияВвода.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.ОтсутствиеССохранениемОплаты"));
	ДопустимыеЗначенияВвода.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.ОтпускПоБеременностиИРодам"));
	ДопустимыеЗначенияВвода.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.ОтпускНаСанаторноКурортноеЛечение"));
	
	ПараметрыВыбораВидуПериода = Новый Массив;
	Для каждого ПараметрВыбора Из Элементы.НачисленияВидПериода.ПараметрыВыбора Цикл
		Если ПараметрВыбора.Имя = "Отбор.Ссылка" Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыВыбораВидуПериода.Добавить(ПараметрВыбора);
	КонецЦикла; 
	
	ПараметрыВыбораВидуПериода.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ДопустимыеЗначенияВвода)));
	
	Элементы.НачисленияВидПериода.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораВидуПериода);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ПараметрыФО = Новый Структура("Организация", Объект.Организация);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()

	СписокНачислений = ПланыВидовРасчета.Начисления.НачисленияПоКатегории(ПредопределенноеЗначение("Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПредыдущимиДокументами"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВидРасчета",
		"Видимость",
		СписокНачислений.Количество() <> 1);

КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеПодразделений()
	
	Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям")
		И ЗначениеЗаполнено(Объект.Подразделение) Тогда
		
		ВидимостьПодразделенийВТабличнойЧасти = Ложь;
	Иначе
		ВидимостьПодразделенийВТабличнойЧасти = Истина;
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СотрудникиПодразделение",
		"Видимость",
		ВидимостьПодразделенийВТабличнойЧасти);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ЗначенияДляЗаполнения = Новый Структура;
		ЗначенияДляЗаполнения.Вставить("Организация",	"Объект.Организация");
		Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") Тогда
			ЗначенияДляЗаполнения.Вставить("Подразделение", "Объект.Подразделение");
		КонецЕсли;
		
		ЗарплатаКадры.ЗаполнитьЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Организация"));
		
		
		НастроитьОтображениеПодразделений();
		
	КонецЕсли;
		
	УстановитьФункциональныеОпцииФормы();
	
КонецПроцедуры

&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	Возврат ПоместитьВоВременноеХранилище(Объект.Начисления.Выгрузить(,"Сотрудник").ВыгрузитьКолонку("Сотрудник"), УникальныйИдентификатор);
КонецФункции

&НаСервере
Процедура СотрудникиОбработкаВыбораНаСервере(ВыбранныеСотрудники)

	Если ТипЗнч(ВыбранныеСотрудники) = Тип("Массив") Тогда
		СписокСотрудников = ВыбранныеСотрудники;
	Иначе
		СписокСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранныеСотрудники);
	КонецЕсли;
	
	Для каждого Сотрудник Из СписокСотрудников Цикл
		
		Если Объект.Начисления.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник)).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		НоваяСтрокаСотрудников = Объект.Начисления.Добавить();
		НоваяСтрокаСотрудников.Сотрудник = Сотрудник;
		НоваяСтрокаСотрудников.ДатаНачала = Объект.ПериодРегистрации;
		НоваяСтрокаСотрудников.ДатаОкончания = Объект.ПериодРегистрации;
		
		ДополнитьСтрокуНаСервере(НоваяСтрокаСотрудников.ПолучитьИдентификатор(), ОписаниеТаблицыНачислений(), Истина, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСтрокуРасчета(ТекущиеДанные)

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Сотрудник)
		ИЛИ Не ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала)
		ИЛИ Не ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	РасчетЗарплатыРасширенныйКлиент.ДополнитьСтрокуРасчета(ЭтаФорма, ОписаниеТаблицыНачислений(), Истина, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСтроку(ИдентификаторСтроки, ОписаниеТаблицы, ЗаполнятьСведенияСотрудников, ЗаполнятьЗначенияПоказателей) Экспорт
	ДополнитьСтрокуНаСервере(ИдентификаторСтроки, ОписаниеТаблицы, ЗаполнятьСведенияСотрудников, ЗаполнятьЗначенияПоказателей)
КонецПроцедуры

&НаСервере
Процедура ДополнитьСтрокуНаСервере(ИдентификаторСтроки, ОписаниеТаблицы, ЗаполнятьСведенияСотрудников, ЗаполнятьЗначенияПоказателей)

	РасчетЗарплатыРасширенныйФормы.ДополнитьСтрокуРасчета(
		ЭтаФорма,
		ОписаниеДокумента(ЭтотОбъект),
		ИдентификаторСтроки,
		ОписаниеТаблицыНачислений(),
		ЗаполнятьСведенияСотрудников,
		ЗаполнятьЗначенияПоказателей);
	
КонецПроцедуры

// Описания документа, таблиц документа, панелей документа.
&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеДокумента(Форма)
	
	Описание = РасчетЗарплатыРасширенныйКлиентСервер.ОписаниеРасчетногоДокумента();
	
	Описание.НачисленияИмя = "Начисления";
	Описание.НачисленияКоманднаяПанельИмя = "НачисленияКоманднаяПанельГруппа";
	Описание.ВидНачисленияВШапке = Истина;
	Описание.ВидНачисленияИмя = "ВидРасчета";
	Описание.МесяцНачисленияИмя = "ПериодРегистрации";
	Описание.ОбязательныеПоля.Добавить(РасчетЗарплатыРасширенныйКлиентСервер.ОписаниеОбязательногоПоляДокумента(НСтр("ru = 'Месяц начисления'"), "МесяцНачисленияСтрокой"));
	
	Возврат Описание;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеТаблицыНачислений()
	
	Описание = РасчетЗарплатыРасширенныйКлиентСервер.ОписаниеТаблицыРасчета();
	Описание.СодержитПолеСотрудник = Истина;
	Описание.ИмяРеквизитаСотрудник = "Сотрудник";
	Описание.СодержитПолеВидРасчета = Ложь;
	Описание.ИмяРеквизитаВидРасчета = "ВидРасчета";
	Описание.ИмяРеквизитаПериод = "ПериодРегистрации";
	Описание.ОтменятьВсеИсправления	= Истина;
	Описание.ОтображатьПоляРаспределенияРезультатов	= Ложь;
	
	Возврат Описание;
	
КонецФункции

&НаСервере
Функция УстановитьВидРасчета()

	СписокНачислений = ПланыВидовРасчета.Начисления.НачисленияПоКатегории(ПредопределенноеЗначение("Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПредыдущимиДокументами"));
	Если СписокНачислений.Количество() > 0 Тогда
		Объект.ВидРасчета = СписокНачислений[0];
	КонецЕсли;
	
КонецФункции

#КонецОбласти
